# Scenario 1

Import libraries

In [1]:
import pandas as pd

Read in SIS data to dataframe

In [ ]:
df_sis = pd.read_excel('data.xlsx', sheet_name=1)

In [3]:
df_sis.head()

,School,StudentID,StateID,FirstName,LastName,Gender,Grade,DOB,Ethnicity,EntryDate,ExitDate
0,OUJH,15524,6137711.0,Milad,Abdulaziz,M,9.0,2000-09-15,B,2015-08-01,2016-05-31
1,OUJH,92924,7767550.0,Caspian,Amelio,M,9.0,2001-04-18,B,2015-08-01,2016-05-31
2,OUJH,76151,7020160.0,Melanie,Aragoni,F,9.0,2001-06-25,B,2015-08-01,2016-05-31
3,OUJH,46166,9149101.0,Lucia,Bingman,F,9.0,2000-09-28,B,2015-08-01,2016-05-31
4,OUJH,83230,6182781.0,Andrew,Blacio,M,9.0,2001-06-28,B,2015-08-01,2016-05-31

Read in State data to dataframe

In [4]:
df_state = pd.read_excel('data.xlsx', sheet_name=2)

In [5]:
df_state.head()

,SchoolID,StateID,FirstName,LastName,Gender,Grade,DOB,Ethnicity,EntryDate,ExitDate,Classification
0,1013,6137711,MILAD,ABDULAZIZ,M,9.0,2000-09-15,B,2015-08-01,NaT,3
1,1013,7767550,CASPIAN,AMELIO,M,9.0,2001-04-18,B,2015-08-01,NaT,4
2,1013,7020160,MELANIE,ARAGONI,F,9.0,2001-06-25,B,2015-08-01,NaT,3
3,1013,9149101,LUCIA,BINGMAN,F,9.0,2000-09-28,B,2015-08-01,NaT,2
4,1013,6182781,ANDREW,BLACIO,M,9.0,2001-06-28,B,2015-08-01,NaT,2

View state column headers

In [6]:
df_state.columns

Index(['SchoolID', 'StateID', 'FirstName', 'LastName', 'Gender', 'Grade',
       'DOB', 'Ethnicity', 'EntryDate', 'ExitDate', 'Classification'],
      dtype='object')

View SIS column headers

In [7]:
df_sis.columns

Index(['School', 'StudentID', 'StateID', 'FirstName', 'LastName', 'Gender',
       'Grade', 'DOB', 'Ethnicity', 'EntryDate', 'ExitDate'],
      dtype='object')

View State data types

In [8]:
df_state.dtypes

SchoolID                   int64
StateID                    int64
FirstName                 object
LastName                  object
Gender                    object
Grade                    float64
DOB               datetime64[ns]
Ethnicity                 object
EntryDate         datetime64[ns]
ExitDate          datetime64[ns]
Classification             int64
dtype: object

View SIS data types

In [9]:
df_sis.dtypes

School               object
StudentID             int64
StateID             float64
FirstName            object
LastName             object
Gender               object
Grade               float64
DOB          datetime64[ns]
Ethnicity            object
EntryDate    datetime64[ns]
ExitDate     datetime64[ns]
dtype: object

Fill NA values in SIS with a zero

In [10]:
df_sis = df_sis.fillna(0)

Change StateID in SIS dataframe to integer

In [11]:
df_sis.astype({'StateID': 'int64'}).dtypes

School               object
StudentID             int64
StateID               int64
FirstName            object
LastName             object
Gender               object
Grade               float64
DOB                  object
Ethnicity            object
EntryDate    datetime64[ns]
ExitDate     datetime64[ns]
dtype: object

Set index in SIS data to StateID

In [12]:
df_sis = df_sis.set_index('StateID')

Set index in State data to StateID

In [13]:
df_state = df_state.set_index('StateID')

In [14]:
df_state.head()

,SchoolID,FirstName,LastName,Gender,Grade,DOB,Ethnicity,EntryDate,ExitDate,Classification
StateID,,,,,,,,,,
6137711,1013,MILAD,ABDULAZIZ,M,9.0,2000-09-15,B,2015-08-01,NaT,3
7767550,1013,CASPIAN,AMELIO,M,9.0,2001-04-18,B,2015-08-01,NaT,4
7020160,1013,MELANIE,ARAGONI,F,9.0,2001-06-25,B,2015-08-01,NaT,3
9149101,1013,LUCIA,BINGMAN,F,9.0,2000-09-28,B,2015-08-01,NaT,2
6182781,1013,ANDREW,BLACIO,M,9.0,2001-06-28,B,2015-08-01,NaT,2

Compare number of rows in State with number of rows in SIS

In [15]:
len(df_state)

2933

In [16]:
len(df_sis)

2938

Merge two dataframes on StateID with outer join

In [17]:
df_merge = pd.merge(df_state, df_sis, on='StateID', how='outer')

Check length of merged df

In [18]:
len(df_merge)

2941

Change format of FirstName and LastName columns in SIS df to uppercase to match State df

In [19]:
df_sis['FirstName'] = df_sis['FirstName'].str.upper()

In [20]:
df_sis['LastName'] = df_sis['LastName'].str.upper()

In [21]:
df_sis.head()

,School,StudentID,FirstName,LastName,Gender,Grade,DOB,Ethnicity,EntryDate,ExitDate
StateID,,,,,,,,,,
6137711.0,OUJH,15524,MILAD,ABDULAZIZ,M,9.0,2000-09-15 00:00:00,B,2015-08-01,2016-05-31
7767550.0,OUJH,92924,CASPIAN,AMELIO,M,9.0,2001-04-18 00:00:00,B,2015-08-01,2016-05-31
7020160.0,OUJH,76151,MELANIE,ARAGONI,F,9.0,2001-06-25 00:00:00,B,2015-08-01,2016-05-31
9149101.0,OUJH,46166,LUCIA,BINGMAN,F,9.0,2000-09-28 00:00:00,B,2015-08-01,2016-05-31
6182781.0,OUJH,83230,ANDREW,BLACIO,M,9.0,2001-06-28 00:00:00,B,2015-08-01,2016-05-31

Concatenate State and SIS df then sort by name

In [22]:
df_concat = pd.concat([df_state, df_sis], sort=True)

In [31]:
df_sorted = df_concat.sort_values(by=['LastName', 'FirstName'])

Drop columns that don't exist in other system

In [34]:
df_sorted = df_sorted.drop(axis = 1, columns= ['Classification', 'ExitDate', 'School', 'SchoolID', 'StudentID'])

In [35]:
df_sorted.head()

,DOB,EntryDate,Ethnicity,FirstName,Gender,Grade,LastName
StateID,,,,,,,
8866962.0,1998-02-16 00:00:00,2015-08-01,B,CAMILA,F,12.0,AANDERUD
8866962.0,1998-02-16 00:00:00,2015-08-01,B,CAMILA,F,12.0,AANDERUD
6137711.0,2000-09-15 00:00:00,2015-08-01,B,MILAD,M,9.0,ABDULAZIZ
6137711.0,2000-09-15 00:00:00,2015-08-01,B,MILAD,M,9.0,ABDULAZIZ
7621581.0,1998-11-03 00:00:00,2015-08-01,H,CARSON,M,11.0,ABEYTA

Only keep rows that aren't duplicated

In [47]:
dup_rows = df_sorted[df_sorted.duplicated(keep=False) == False]

In [50]:
dup_rows

,DOB,EntryDate,Ethnicity,FirstName,Gender,Grade,LastName
StateID,,,,,,,
6.658813e+06,1998-03-08 00:00:00,2015-08-01,B,BRENNON,M,12.0,AHNELL
6.658813e+06,0,2015-08-01,B,BRENNON,M,12.0,AHNELL
5.903576e+06,2002-07-28 00:00:00,2015-08-01,B,BRADEN,M,8.0,AHUNA
5.903576e+06,2001-07-28 00:00:00,2015-08-01,B,BRADEN,M,9.0,AHUNA
3.416733e+06,1999-08-09 00:00:00,2015-08-01,B,RYAN,M,11.0,BARRY
3.416733e+06,0,2015-08-01,B,RYAN,M,11.0,BARRY
2.680118e+06,1998-08-13 00:00:00,2015-08-01,B,LEXI,F,12.0,BEUTEL
2.680118e+06,1998-08-13 00:00:00,2015-08-01,B,LEXY,F,12.0,BEUTEL
6.301815e+06,1999-01-23 00:00:00,2015-08-01,B,ZIANA,F,11.0,CHRYSTAL
6.301815e+06,1999-01-23 00:00:00,2015-08-01,0,ZIANA,F,11.0,CHRYSTAL
7.793552e+06,1997-09-19 00:00:00,2015-08-01,B,VONTRELL,M,12.0,CILLEY
5.786182e+06,1999-01-03 00:00:00,2015-08-01,B,VANESSA,M,11.0,COKINS
5.786182e+06,1999-01-03 00:00:00,2015-08-01,0,VANESSA,M,11.0,COKINS
8.393341e+06,1998-12-17 00:00:00,2015-08-04,B,ARIANNA,F,11.0,DUMDEI
8.393341e+06,1998-12-17 00:00:00,2015-08-01,B,ARIANNA,F,11.0,DUMDEI
0.000000e+00,2000-10-10 00:00:00,2015-08-01,B,BISHOP,M,9.0,FOLGER
8.912935e+06,1997-11-21 00:00:00,2015-08-01,H,JOHNATHON,M,12.0,GANGWISH
9.777171e+06,2010-08-20 00:00:00,2015-08-01,B,MASON,M,NaN,HAILEY
9.777171e+06,1998-08-20 00:00:00,2015-08-01,B,MASON,M,12.0,HAILEY
7.869139e+06,2000-10-08 00:00:00,2015-08-01,B,TIFFANY,F,9.0,HEIDEMA
7.869139e+06,2000-10-08 00:00:00,2015-08-01,D,TIFFANY,F,9.0,HEIDEMA
1.825529e+06,2009-08-27 00:00:00,2015-09-02,B,LAUREN,F,1.0,HERNANDES
1.825529e+06,2009-08-27 00:00:00,2015-09-02,B,LAUREN,0,1.0,HERNANDES
8.170502e+06,2007-07-07 00:00:00,2015-08-01,B,HEAVEN,F,3.0,HOLLANDSWORTH
8.170502e+06,0,2015-08-01,B,HEAVEN,F,3.0,HOLLANDSWORTH
3.898246e+06,2010-08-09 00:00:00,2015-08-01,B,SKYLER,M,0.0,LOYACK
3.898246e+06,2016-08-09 00:00:00,2015-08-01,B,SKYLER,M,0.0,LOYACK
3.601325e+06,2001-05-03 00:00:00,2015-08-01,B,CHRISTIAN,M,9.0,MINVIELLE
3.601325e+06,1990-05-03 00:00:00,2015-08-01,B,CHRISTIAN,M,9.0,MINVIELLE
9.960409e+06,2008-11-14 00:00:00,2015-08-01,B,COLIN,M,1.0,MULVANEY
9.960409e+06,2008-11-14 00:00:00,2015-08-01,0,COLIN,M,1.0,MULVANEY
4.004891e+06,2009-02-03 00:00:00,2015-08-01,B,ADALYN,F,1.0,NARAMORE
4.004891e+06,2009-02-02 00:00:00,2015-08-01,B,ADALYN,F,1.0,NARAMORE
5.824926e+06,2001-01-24 00:00:00,2015-08-01,B,CAYLEE,F,9.0,PARROT
5.824926e+06,2001-01-24 00:00:00,2015-08-01,B,CAYLEE,F,9.0,PARROTT
2.930604e+06,1999-04-10 00:00:00,2015-08-01,B,ANDREW,M,11.0,RIDEAU
4.903961e+06,1998-07-03 00:00:00,2015-08-01,B,LAWRENCE,M,12.0,SHAUGHNESSY
4.903961e+06,1998-07-03 00:00:00,2015-08-01,B,LAWRENCE,0,12.0,SHAUGHNESSY
6.691966e+06,2010-04-19 00:00:00,2015-08-01,B,ROBIN,F,0.0,SUTTEN
4.116930e+06,2000-11-19 00:00:00,NaT,B,OWEN,M,9.0,SWEARINGEN
4.116930e+06,2000-11-19 00:00:00,2015-08-01,B,OWEN,M,9.0,SWEARINGEN
1.646700e+04,2000-09-03 00:00:00,2015-08-18,H,ZACHARY,M,9.0,TONNESEN
3.800777e+06,2001-07-05 00:00:00,2015-08-10,H,RACHEL,F,9.0,WAWRZYNIAK
3.800777e+06,2001-07-05 00:00:00,2015-08-01,H,RACHEL,F,9.0,WAWRZYNIAK
2.946942e+09,2001-08-13 00:00:00,2015-08-01,B,BRODY,M,9.0,WIEDENHEFT
8.755508e+06,2001-08-12 00:00:00,2015-08-01,B,MARCOS,M,9.0,ZICHERMAN
8.755508e+06,2001-08-12 00:00:00,2015-08-01,B,MARCOS,M,9.0,ZICKERMAN
2.563251e+06,1999-01-19 00:00:00,2015-08-01,B,TRENTON,M,11.0,ZILK
2.563251e+06,1998-01-19 00:00:00,2015-08-01,B,TRENTON,M,12.0,ZILK

In [53]:
len(dup_rows)

49

In [51]:
dup_rows.dtypes

DOB                  object
EntryDate    datetime64[ns]
Ethnicity            object
FirstName            object
Gender               object
Grade               float64
LastName             object
dtype: object

Export error report to error_report.csv

In [52]:
dup_rows.to_csv('error_report.csv')